In [1]:
import pandas as pd

In [ ]:
# series, dataframe

s=[1,2,3,4,5,6]
d=[[1,2,3,4][1,2,3,4]]

In [2]:
series1=pd.Series(range(1,12))

In [3]:
series1

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
dtype: int64

In [4]:
type(series1)

pandas.core.series.Series

In [6]:
series1[0]

1

In [7]:
series1[:7]

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [15]:
series1.iloc[5:7]

5    6
6    7
dtype: int64

In [14]:
series1.loc[5:7]

5    6
6    7
7    8
dtype: int64

In [47]:
df = pd.DataFrame([[1,2,3,4],[4,5,6],[7,8,9],[10,11,12]])

In [48]:
df.shape

(4, 4)

In [49]:
df

    0   1   2    3
0   1   2   3  4.0
1   4   5   6  NaN
2   7   8   9  NaN
3  10  11  12  NaN

In [90]:
df.loc[1:2,2]

1    6
2    9
Name: 2, dtype: int64

In [91]:
df.iloc[1:3,2]

1    6
2    9
Name: 2, dtype: int64

In [116]:
df = pd.DataFrame(range(12))

In [117]:
df

     0
0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
10  10
11  11

In [107]:
arr = df[0].values

In [118]:
type(arr)

numpy.ndarray

In [108]:
arr.reshape(3,4)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]], dtype=int64)

In [109]:
reshaped = arr.reshape(3,4)

In [115]:
type(reshaped)

numpy.ndarray

In [112]:
df = pd.DataFrame(reshaped)

In [113]:
df

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [119]:
import numpy as np

In [127]:
np.arange(12).reshape(3,4)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [158]:
df1 = pd.DataFrame(np.arange(12).reshape(4,3),index=['Row1','Row2','Row3','Row4'],columns=['One','Two','Three'])

In [159]:
df1.reset_index()

  index  One  Two  Three
0  Row1    0    1      2
1  Row2    3    4      5
2  Row3    6    7      8
3  Row4    9   10     11

In [163]:
df1.set_index('One')

     Two  Three
One
0      1      2
3      4      5
6      7      8
9     10     11

In [165]:
df1.reset_index()

  index  One  Two  Three
0  Row1    0    1      2
1  Row2    3    4      5
2  Row3    6    7      8
3  Row4    9   10     11

In [175]:
filepath = 'C:\\Users\\karan\\Documents\\RJ College\\Lectures\\Foundation of Data Science\\Foundation of Data Science\\Labs\\Assignments\\Dataset'
path = filepath.replace("\\","/")
path

'C:/Users/karan/Documents/RJ College/Lectures/Foundation of Data Science/Foundation of Data Science/Labs/Assignments/Dataset'

In [182]:
df1 = pd.read_csv(path + '/ex5.csv')

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [186]:
df1.sort_index()

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [216]:
df2=pd.merge(df1,df1,on='a',suffixes=('_left','_right'))

In [217]:
df2

,something_left,a,b_left,c_left,d_left,message_left,something_right,b_right,c_right,d_right,message_right
0,one,1,2,3.0,4,NaN,one,2,3.0,4,NaN
1,two,5,6,NaN,8,world,two,6,NaN,8,world
2,three,9,10,11.0,12,foo,three,10,11.0,12,foo

In [ ]:
df2.sum(level=)